burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_rcu.c
/*!
    \file    gd32m53x_rcu.c
    \brief   RCU driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/
#include "gd32m53x_rcu.h"

/* define clock source */
#define SEL_IRC32M                  ((uint16_t)0U)  /* IRC32M is selected as CK_SYS */
#define SEL_HXTAL                   ((uint16_t)1U)  /* HXTAL is selected as CK_SYS */
#define SEL_PLL                     ((uint16_t)2U)  /* PLL is selected as CK_SYS */

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT         ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT       ((uint32_t)0x03FFFFFFU)

/* RCU IRC32M adjust value mask and offset */
#define RCU_IRC32M_ADJUST_MASK      ((uint8_t)0x1FU)
#define RCU_IRC32M_ADJUST_OFFSET    ((uint32_t)3U)

#define RCU_CKOUTSEL_MASK           ((uint32_t)0x87000000U)
#define RCU_SYSRST_MASK             ((uint32_t)0x00006400U)

/*!
    \brief      deinitialize the RCU (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_deinit(void)
{
    /* enable IRC32M */
    RCU_CTL |= RCU_CTL_IRC32MEN;
    while(0U == (RCU_CTL & RCU_CTL_IRC32MSTB)) {
    }
    RCU_CFG0 &= ~RCU_CFG0_SCS;
    while((RCU_CFG0 & RCU_CFG0_SCSS) != RCU_SCSS_IRC32M) {
    }
    /* reset CTL register */
    RCU_CTL &= ~(RCU_CTL_HXTALEN | RCU_CTL_CKMEN | RCU_CTL_PLLEN | RCU_CTL_HXTALSCAL | RCU_CTL_PLLMEN);
    RCU_CTL &= ~RCU_CTL_HXTALBPS;

    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC |
                  RCU_CFG0_PLLSEL | RCU_CFG0_PLLMF | RCU_CFG0_CKOUTSEL | RCU_CFG0_PLLDV);

    /* reset INT register */
    RCU_INT = 0x00DD0000U;
}

/*!
    \brief      enable the peripherals clock (API_ID(0x0002U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMU: TMU clock
      \arg        RCU_SVPWM: SVPWM clock
      \arg        RCU_GTOC: GTOC clock
      \arg        RCU_POC: POC clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G,N): GPIO ports clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_CAN: CAN clock
      \arg        RCU_EVIC: EVIC clock
      \arg        RCU_TIMERx (x = 0,1,2,7): TIMER clock
      \arg        RCU_GPTIMERx (x = 0,1): GPTIMER clock
      \arg        RCU_CPTIMERx (x = 0,1,W): CPTIMER clock
      \arg        RCU_SPI: SPI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_UARTx(x =0,1,2,3): UART clock
      \arg        RCU_I2C: I2C clock
      \arg        RCU_SYSCFG: System configuration clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_CFMU: CFMU clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_ADCx (x = 0,2): ADC clock
      \arg        RCU_CMP: CMP clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_enable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock (API_ID(0x0003U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMU: TMU clock
      \arg        RCU_SVPWM: SVPWM clock
      \arg        RCU_GTOC: GTOC clock
      \arg        RCU_POC: POC clock
      \arg        RCU_GPIOx (x = A,B,C,D,E,F,G,N): GPIO ports clock
      \arg        RCU_CRC: CRC clock
      \arg        RCU_DMAMUX: DMAMUX clock
      \arg        RCU_DMAx (x = 0,1): DMA clock
      \arg        RCU_CAN: CAN clock
      \arg        RCU_EVIC: EVIC clock
      \arg        RCU_TIMERx (x = 0,1,2,7): TIMER clock
      \arg        RCU_GPTIMERx (x = 0,1): GPTIMER clock
      \arg        RCU_CPTIMERx (x = 0,1,W): CPTIMER clock
      \arg        RCU_SPI: SPI clock
      \arg        RCU_WWDGT: WWDGT clock
      \arg        RCU_UARTx(x =0,1,2,3): UART clock
      \arg        RCU_I2C: I2C clock
      \arg        RCU_SYSCFG: System configuration clock
      \arg        RCU_PMU: PMU clock
      \arg        RCU_CFMU: CFMU clock
      \arg        RCU_DAC: DAC clock
      \arg        RCU_ADCx (x = 0,2): ADC clock
      \arg        RCU_CMP: CMP clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_disable(rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the peripherals clock when sleep mode (API_ID(0x0004U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FMC_SLP: FMC clock
      \arg        RCU_SRAM_SLP: SRAM clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_enable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock when sleep mode (API_ID(0x0005U))
    \param[in]  periph: RCU peripherals, refer to rcu_periph_sleep_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_SRAM_SLP: SRAM clock
    \param[out] none
    \retval     none
*/
void rcu_periph_clock_sleep_disable(rcu_periph_sleep_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      reset the peripherals (API_ID(0x0006U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMURST: TMU clock
      \arg        RCU_SVPWMRST: SVPWM clock
      \arg        RCU_GTOCRST: GTOC clock
      \arg        RCU_POCRST: POC clock
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G,N): GPIO ports clock
      \arg        RCU_CRCRST: CRC clock
      \arg        RCU_DMAMUXRST: DMAMUX clock
      \arg        RCU_DMAxRST (x = 0,1): DMA clock
      \arg        RCU_CANRST: CAN clock
      \arg        RCU_TIMERxRST (x = 0,1,2,7): TIMER clock
      \arg        RCU_GPTIMERxRST (x = 0,1): GPTIMER clock
      \arg        RCU_CPTIMERxRST (x = 0,1,W): CPTIMER clock
      \arg        RCU_SPIRST: SPI clock
      \arg        RCU_WWDGTRST: WWDGT clock
      \arg        RCU_UARTxRST(x =0,1,2,3): UART clock
      \arg        RCU_I2CRST: I2C clock
      \arg        RCU_SYSCFGRST: System configuration clock
      \arg        RCU_PMURST: PMU clock
      \arg        RCU_CFMURST: CFMU clock
      \arg        RCU_DACRST: DAC clock
      \arg        RCU_ADCxRST (x = 0,2): ADC clock
      \arg        RCU_CMPRST: CMP clock
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_enable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripherals (API_ID(0x0007U))
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_TMURST: TMU clock
      \arg        RCU_SVPWMRST: SVPWM clock
      \arg        RCU_GTOCRST: GTOC clock
      \arg        RCU_POCRST: POC clock
      \arg        RCU_GPIOxRST (x = A,B,C,D,E,F,G,N): GPIO ports clock
      \arg        RCU_CRCRST: CRC clock
      \arg        RCU_DMAMUXRST: DMAMUX clock
      \arg        RCU_DMAxRST (x = 0,1): DMA clock
      \arg        RCU_CANRST: CAN clock
      \arg        RCU_TIMERxRST (x = 0,1,2,7): TIMER clock
      \arg        RCU_GPTIMERxRST (x = 0,1): GPTIMER clock
      \arg        RCU_CPTIMERxRST (x = 0,1,W): CPTIMER clock
      \arg        RCU_SPIRST: SPI clock
      \arg        RCU_WWDGTRST: WWDGT clock
      \arg        RCU_UARTxRST(x =0,1,2,3): UART clock
      \arg        RCU_I2CRST: I2C clock
      \arg        RCU_SYSCFGRST: System configuration clock
      \arg        RCU_PMURST: PMU clock
      \arg        RCU_CFMURST: CFMU clock
      \arg        RCU_DACRST: DAC clock
      \arg        RCU_ADCxRST (x = 0,2): ADC clock
      \arg        RCU_CMPRST: CMP clock
    \param[out] none
    \retval     none
*/
void rcu_periph_reset_disable(rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      configure the system clock source (API_ID(0x0008U))
    \param[in]  ck_sys: system clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKSYSSRC_IRC32M: select CK_IRC32M as the CK_SYS source
      \arg        RCU_CKSYSSRC_HXTAL: select CK_HXTAL as the CK_SYS source
      \arg        RCU_CKSYSSRC_PLL: select CK_PLL as the CK_SYS source
    \param[out] none
    \retval     none
*/
void rcu_system_clock_source_config(uint32_t ck_sys)
{
    uint32_t reg;
    reg = RCU_CFG0;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG0_SCS;
    RCU_CFG0 = (reg | (ck_sys & RCU_CFG0_SCS));
}

/*!
    \brief      get the system clock source (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     which clock is selected as CK_SYS source
      \arg        RCU_SCSS_IRC32M: CK_IRC32M is selected as the CK_SYS source
      \arg        RCU_SCSS_HXTAL: CK_HXTAL is selected as the CK_SYS source
      \arg        RCU_SCSS_PLL: CK_PLL is selected as the CK_SYS source
*/
uint32_t rcu_system_clock_source_get(void)
{
    return (RCU_CFG0 & RCU_CFG0_SCSS);
}

/*!
    \brief      configure the AHB clock prescaler selection (API_ID(0x000AU))
    \param[in]  ck_ahb: AHB clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_AHB_CKSYS_DIVx (x = 1, 2, 4, 8, 16, 64, 128, 256, 512): select CK_SYS / x as CK_AHB
    \param[out] none
    \retval     none
*/
void rcu_ahb_clock_config(uint32_t ck_ahb)
{
    uint32_t reg;
    reg = RCU_CFG0;
    /* reset the AHBPSC bits and set according to ck_ahb */
    reg &= ~RCU_CFG0_AHBPSC;
    RCU_CFG0 = (reg | (ck_ahb & RCU_CFG0_AHBPSC));
}

/*!
    \brief      configure the APB1 clock prescaler selection (API_ID(0x000BU))
    \param[in]  ck_apb1: APB1 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB1_CKAHB_DIV1: select CK_AHB as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV2: select CK_AHB / 2 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV4: select CK_AHB / 4 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV8: select CK_AHB / 8 as CK_APB1
      \arg        RCU_APB1_CKAHB_DIV16: select CK_AHB / 16 as CK_APB1
    \param[out] none
    \retval     none
*/
void rcu_apb1_clock_config(uint32_t ck_apb1)
{
    uint32_t reg;
    reg = RCU_CFG0;

    /* reset the APB1PSC and set according to ck_apb1 */
    reg &= ~RCU_CFG0_APB1PSC;
    RCU_CFG0 = (reg | (ck_apb1 & RCU_CFG0_APB1PSC));
}

/*!
    \brief      configure the APB2 clock prescaler selection (API_ID(0x000CU))
    \param[in]  ck_apb2: APB2 clock prescaler selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_APB2_CKAHB_DIV1: select CK_AHB as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV2: select CK_AHB/2 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV4: select CK_AHB/4 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV8: select CK_AHB/8 as CK_APB2
      \arg        RCU_APB2_CKAHB_DIV16: select CK_AHB/16 as CK_APB2
    \param[out] none
    \retval     none
*/
void rcu_apb2_clock_config(uint32_t ck_apb2)
{
    uint32_t reg;
    reg = RCU_CFG0;

    /* reset the APB2PSC and set according to ck_apb2 */
    reg &= ~RCU_CFG0_APB2PSC;
    RCU_CFG0 = (reg | (ck_apb2 & RCU_CFG0_APB2PSC));
}

/*!
    \brief      configure the CK_OUT clock source (API_ID(0x000DU))
    \param[in]  ckout_src: CK_OUT clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUTSRC_NONE: no clock selected
      \arg        RCU_CKOUTSRC_IRC32K: IRC32K selected
      \arg        RCU_CKOUTSRC_CKSYS: system clock selected
      \arg        RCU_CKOUTSRC_IRC32M: high speed 32M internal oscillator clock selected
      \arg        RCU_CKOUTSRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUTSRC_CKPLL_DIV1: CK_PLL selected
      \arg        RCU_CKOUTSRC_CKPLL_DIV8: CK_PLL/8 selected
    \param[in]  ckout_div: CK_OUT divider
      \arg        RCU_CKOUT_DIVx(x=1,2,4,8,16,32,64,128): CK_OUT is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout_config(uint32_t ckout_src, uint32_t ckout_div)
{
    uint32_t ckout = 0U;
    ckout = RCU_CFG0;
    /* reset the CKOUTSEL, CKOUTDIV and PLLDV bits and set according to ckout_src and ckout_div */
    ckout &= ~(RCU_CFG0_CKOUTSEL | RCU_CFG0_CKOUTDIV | RCU_CFG0_PLLDV);
    RCU_CFG0 = (ckout | (ckout_src & RCU_CKOUTSEL_MASK) | (ckout_div & RCU_CFG0_CKOUTDIV));
}

/*!
    \brief      configure the main PLL clock (API_ID(0x000EU))
    \param[in]  pll_src: PLL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLSRC_IRC32M: IRC32M clock selected as source clock of PLL
      \arg        RCU_PLLSRC_HXTAL: HXTAL selected as source clock of PLL
    \param[in]  predv_div: PREDV division factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PREDV_DIVx, x = 1..8
    \param[in]  pll_mul: PLL clock multiplication factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL_MULx (x= 4,4.5,5,5.5...63.5,64): PLL clock * x
    \param[out] none
    \retval     none
*/
void rcu_pll_config(uint32_t pll_src, uint32_t predv_div, uint32_t pll_mul)
{
    uint32_t reg0 = 0U, reg1 = 0U;
    reg0 = RCU_CFG0;
    /* PLL clock source and multiplication factor configuration */
    reg0 &= ~(RCU_CFG0_PLLSEL | RCU_CFG0_PLLMF);
    reg0 |= ((pll_src & RCU_CFG0_PLLSEL) | (pll_mul & RCU_CFG0_PLLMF));
    RCU_CFG0 = reg0;

