burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_rcu.c
    reg1 = RCU_CFG1;
    /* PREDV division factor configuration */
    reg1 &= ~RCU_CFG1_PREDV;
    reg1 |= predv_div & RCU_CFG1_PREDV;
    RCU_CFG1 = reg1;
}

/*!
    \brief      enable RCU system reset (API_ID(0x000FU))
    \param[in]  reset_source: reset source
                one or more parameters can be selected which is shown as below:
      \arg        RCU_SYSRST_LOCKUP: CPU lock-up reset
      \arg        RCU_SYSRST_LOH: lost of HXTAL reset
      \arg        RCU_SYSRST_LOP: lost of PLL reset
    \param[out] none
    \retval     none
*/
void rcu_system_reset_enable(uint32_t reset_source)
{
    RCU_RSTSCK |= reset_source & RCU_SYSRST_MASK;
}

/*!
    \brief      disable RCU system reset (API_ID(0x0010U))
    \param[in]  reset_source: reset source
                one or more parameters can be selected which is shown as below:
      \arg        RCU_SYSRST_LOCKUP: CPU lock-up reset
      \arg        RCU_SYSRST_LOH: lost of HXTAL reset
      \arg        RCU_SYSRST_LOP: lost of PLL reset
    \param[out] none
    \retval     none
*/
void rcu_system_reset_disable(uint32_t reset_source)
{
    RCU_RSTSCK &= ~(reset_source & RCU_SYSRST_MASK);
}

/*!
    \brief      configure the CK_ADCPRE clock source and division factor (API_ID(0x0011U))
    \param[in]  ck_adc: ADC clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK_ADCPRE_PCLK2: select CK_PCLK2 as the CK_ADC source
      \arg        RCU_CK_ADCPRE_HXTAL: select CK_HXTAL as the CK_ADC source
      \arg        RCU_CK_ADCPRE_PLL: select CK_PLL as the CK_ADC source
      \arg        RCU_CK_ADCPRE_IRC32M: select IRC32M as the CK_ADC source
    \param[in]  adc_psc: ADC prescaler factor
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK_ADCPRE_DIVx(x = 2,3...31,32): ADC prescaler select CK_ADCPRE/ x
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(uint32_t ck_adc, uint32_t adc_psc)
{
    uint32_t reg;
    /* reset the ADCPSC bits */
    reg = RCU_CFG2;
    reg &= ~(RCU_CFG2_ADCPSC | RCU_CFG2_ADCSEL);
    reg |= ((adc_psc & RCU_CFG2_ADCPSC) | (ck_adc & RCU_CFG2_ADCSEL));
    RCU_CFG2 = reg;
}

/*!
    \brief      configure the CK_I2C clock source (API_ID(0x0012U))
    \param[in]  ck_i2c: i2c clock source select
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKI2CSRC_PCLK1: select CK_PCLK1 as the CK_I2C source
      \arg        RCU_CKI2CSRC_PLL: select CK_PLL as the CK_I2C source
      \arg        RCU_CKI2CSRC_IRC32M: select CK_IRC32M as the CK_I2C source
      \arg        RCU_CKI2CSRC_HXTAL: select CK_HXTAL as the CK_I2C source
    \param[out] none
    \retval     none
*/
void rcu_i2c_clock_source_config(uint32_t ck_i2c)
{
    uint32_t reg;
    reg = RCU_CFG2;
    /* reset the SCS bits and set according to ck_sys */
    reg &= ~RCU_CFG2_I2CSEL;
    RCU_CFG2 = (reg | (ck_i2c & RCU_CFG2_I2CSEL));
}

/*!
    \brief      wait for oscillator stabilization flags is SET or oscillator startup is timeout (API_ID(0x0013U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_IRC32M: internal 32M RC oscillators(IRC32M)
      \arg        RCU_IRC32K: internal 32K RC oscillator(IRC32K)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_osci_stab_wait(rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;

    switch(osci) {
    /* wait HXTAL stable */
    case RCU_HXTAL:
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait IRC32M stable */
    case RCU_IRC32M:
        while((RESET == osci_stat) && (IRC32M_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC32MSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC32MSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait IRC32K stable */
    case RCU_IRC32K:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_IRC32KSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_IRC32KSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait PLL stable */
    case RCU_PLL_CK:
        while((RESET == osci_stat) && (OSC_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = rcu_flag_get(RCU_FLAG_PLLSTB);
            stb_cnt++;
        }
        /* check whether flag is set or not */
        if(RESET != rcu_flag_get(RCU_FLAG_PLLSTB)) {
            reval = SUCCESS;
        }
        break;
    default:
        break;
    }
    /* return value */
    return reval;
}

/*!
    \brief      turn on the oscillator (API_ID(0x0014U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_IRC32M: internal 32M RC oscillators(IRC32M)
      \arg        RCU_IRC32K: internal 32K RC oscillator(IRC32K)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     none
*/
void rcu_osci_on(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) |= BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      turn off the oscillator (API_ID(0x0015U))
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: high speed crystal oscillator(HXTAL)
      \arg        RCU_IRC32M: internal 32M RC oscillators(IRC32M)
      \arg        RCU_IRC32K: internal 32K RC oscillator(IRC32K)
      \arg        RCU_PLL_CK: phase locked loop(PLL)
    \param[out] none
    \retval     none
*/
void rcu_osci_off(rcu_osci_type_enum osci)
{
    RCU_REG_VAL(osci) &= ~BIT(RCU_BIT_POS(osci));
}

/*!
    \brief      enable the oscillator bypass mode, HXTALEN must be reset before it (API_ID(0x0016U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_enable(void)
{
    uint32_t reg;
    /* enable HXTAL to bypass mode */
    reg = RCU_CTL;
    RCU_CTL &= ~RCU_CTL_HXTALEN;
    RCU_CTL = (reg | RCU_CTL_HXTALBPS);
}

/*!
    \brief      disable the oscillator bypass mode, HXTALEN must be reset before it (API_ID(0x0017U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_osci_bypass_mode_disable(void)
{
    uint32_t reg;
    reg = RCU_CTL;
    RCU_CTL &= ~RCU_CTL_HXTALEN;
    RCU_CTL = (reg & ~RCU_CTL_HXTALBPS);
}

/*!
    \brief      HXTAL frequency scale select (API_ID(0x0018U))
    \param[in]  hxtal_scal: HXTAL frequency scale
                only one parameter can be selected which is shown as below:
      \arg        HXTAL_SCALE_1M_TO_10M: HXTAL scale is 1-10MHz
      \arg        HXTAL_SCALE_10M_TO_24M: HXTAL scale is 10-24MHz
    \param[out] none
    \retval     none
*/
void rcu_hxtal_frequency_scale_select(uint32_t hxtal_scal)
{
    if(HXTAL_SCALE_1M_TO_10M == hxtal_scal) {
        RCU_CTL &= ~RCU_CTL_HXTALSCAL;
    } else {
        RCU_CTL |= RCU_CTL_HXTALSCAL;
    }
}

/*!
    \brief      set the IRC32M adjust value (API_ID(0x0019U))
    \param[in]  irc32m_adjval: IRC32M adjust value, must be between 0 and 0x1F
      \arg        0x00 - 0x1F
    \param[out] none
    \retval     none
*/
void rcu_irc32m_adjust_value_set(uint32_t irc32m_adjval)
{
    uint32_t reg;

    reg = RCU_CTL;
    /* reset the IRC32MADJ bits and set according to irc32m_adjval */
    reg &= ~RCU_CTL_IRC32MADJ;
    RCU_CTL = (reg | ((irc32m_adjval & RCU_IRC32M_ADJUST_MASK) << RCU_IRC32M_ADJUST_OFFSET));

